Revit 2027 API
FabricationRodInfo.GetBearerExtension Method
 Gets the bearer extension. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetBearerExtension(
	int rodIndex
)
Public Function GetBearerExtension (
	rodIndex As Integer
) As Double
public:
double GetBearerExtension(
	int rodIndex
)
member GetBearerExtension :
        rodIndex : int -> float
Parameters
rodIndex Int32
 The index of the rod.
Return Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace